# Pandas

In [23]:
import pandas as pd
import numpy as np

## Creation of dataframes
### Creating DataFrames from a NumPy array

In [24]:
df=pd.DataFrame(np.random.randn(2,3), columns=["First", "Second", "Third"], index=["a", "b"])
df

      First    Second     Third
a -1.458959  0.099771 -0.130447
b  0.942970 -0.787032 -0.828552

In [25]:
## asign columns and rows with the Index object
df.index                            # These are the "row names"

Index(['a', 'b'], dtype='object')

In [26]:
df.columns                          # These are the "column names"

Index(['First', 'Second', 'Third'], dtype='object')

In [27]:
# columns or index argument is left out, when an implicit integer index is used:
df2=pd.DataFrame(np.random.randn(2,3), index=["a", "b"])
df2

          0         1         2
a -0.846279  1.032527  0.305790
b  0.269848 -0.100443 -1.817587

In [28]:
## the column index is ab object as the range type:
df2.columns

RangeIndex(start=0, stop=3, step=1)

### Create Dataframe from columns

In [29]:
## columns can be specified as a list, an array, or a Series. column names are given with the `columns` parameter -- for series, the `name`attribute
s1 = pd.Series([1,2,3])
s1

0    1
1    2
2    3
dtype: int64

In [30]:
s2 = pd.Series([4,5,6], name="b")
s2

0    4
1    5
2    6
Name: b, dtype: int64

In [31]:
## give the column name explicitly:
pd.DataFrame(s1, columns=["a"])

   a
0  1
1  2
2  3

In [32]:
## using the name of a series: 
pd.DataFrame(s2)

   b
0  4
1  5
2  6

### Creating dataframes from rows

In [33]:
df=pd.DataFrame([{"Wage" : 1000, "Name" : "Jack", "Age" : 21}, {"Wage" : 1500, "Name" : "John", "Age" : 29}])
df

   Wage  Name  Age
0  1000  Jack   21
1  1500  John   29

In [66]:
df = pd.DataFrame([[1000, "Jack", 21], [1500, "John", 29]], columns=["Wage", "Name", "Age"])
df

   Wage  Name  Age
0  1000  Jack   21
1  1500  John   29

In [35]:
## exercise 01: cities
def cities():  
    indices = ['Helsinki', 'Espoo', 'Tampere', 'Vantaa', 'Oulu']  
    population = [643272, 279044, 231853, 223027, 201810]
    total_area = [715.48, 528.03, 689.59, 240.35, 3817.52]
    s_population = pd.Series(population, index = indices)
    s_total_area = pd.Series(total_area, index = indices)
    df = pd.DataFrame({"Population" : s_population, "Total area" : s_total_area})
    return df

In [36]:
## another solution:
def cities():
    a=[[643272, 715.48],
       [279044, 528.03],
       [231853, 689.59],
       [223027, 240.35],
       [201810, 3817.52]]
    cols=["Population", "Total area"]
    ind=["Helsinki", "Espoo", "Tampere", "Vantaa", "Oulu"]
    df = pd.DataFrame(a, index=ind, columns=cols)
    return df

In [37]:
cities()

          Population  Total area
Helsinki      643272      715.48
Espoo         279044      528.03
Tampere       231853      689.59
Vantaa        223027      240.35
Oulu          201810     3817.52

In [38]:
## exercise 02: power of a series
def powers_of_series(s, k):
    df_power = pd.DataFrame()
    for i in range(1,k+1):
        s_ = pd.Series((s.values) ** i, name = i)
        if i==1:
            df_power = pd.DataFrame(s_)
        if i != 1:
            df_power[i] = s_
    return df_power

In [39]:
s = pd.Series([1,2,3,4], index=list("abcd"))
print(powers_of_series(s, 3))

   1   2   3
0  1   1   1
1  2   4   8
2  3   9  27
3  4  16  64

In [40]:
##actual solution
def powers_of_series(s, k):
    c=[ s**i for i in range(1,k+1) ]
    df = pd.DataFrame(dict(zip(range(1,k+1), c)))
    return df

In [41]:
## exercise 03: municipal imformation
kk = pd.read_csv("municipal.tsv", sep = '\t' )
print(f'Shape: {kk.shape[0]}, {kk.shape[1]}')
print("Columns:")
for column in kk.columns:
    print(column)

Shape: 490, 7
Columns:
Region 2018
Population
Population change from the previous year, %
Share of Swedish-speakers of the population, %
Share of foreign citizens of the population, %
Proportion of the unemployed among the labour force, %
Proportion of pensioners of the population, %

In [42]:
df = pd.read_csv("municipal.tsv", sep="\t")
print("Shape: {}, {}".format(*df.shape))
print("Columns:")
for name in df.columns:
    print(name)

Shape: 490, 7
Columns:
Region 2018
Population
Population change from the previous year, %
Share of Swedish-speakers of the population, %
Share of foreign citizens of the population, %
Proportion of the unemployed among the labour force, %
Proportion of pensioners of the population, %

## accessing columns and rows of DataFrame

In [43]:
## for accessing information on the dataframe, the [] notation will not work as it does with arrays
try:
    df[0]
except KeyError:
    import sys
    print("Key error", file=sys.stderr)

Key error

In [46]:
## you need to say the explicit indices for the column contain that integer. this will work:
df["Wage"]

0    1000
1    1500
Name: Wage, dtype: int64

In [47]:
## also fancy indexing words:
df[["Wage", "Name"]]

   Wage  Name
0  1000  Jack
1  1500  John

In [48]:
## if one indexes with a slice or boolean mask, then the rows are referred to:
df[0:1]                           # slice

   Wage  Name  Age
0  1000  Jack   21

In [49]:
df[df.Wage > 1200]               # boolean mask

   Wage  Name  Age
1  1500  John   29

In [50]:
## for getting a single element of the dataframe, you chain the bracket calls
df["Wage"][1]                    # Note order of dimensions

1500

In [51]:
##exercise 04: municipalities of finland
def municipalities_of_finland():
    municipalities = pd.read_csv("municipal.tsv", sep="\t", index_col = 'Region 2018')[1:312]
    print(municipalities.shape)
    return municipalities

In [52]:
municipalities_of_finland()

(311, 6)

,Population,"Population change from the previous year, %","Share of Swedish-speakers of the population, %","Share of foreign citizens of the population, %","Proportion of the unemployed among the labour force, %","Proportion of pensioners of the population, %"
Region 2018,,,,,,
Akaa,16769,-0.9,0.2,1.6,14.6,26.1
Alajärvi,9831,-0.7,0.1,1.9,13.9,32.0
Alavieska,2610,-1.1,0.2,0.6,10.8,28.4
Alavus,11713,-1.6,0.1,1.1,11.3,31.5
Asikkala,8248,-0.9,0.2,1.6,12.0,35.5
...,...,...,...,...,...,...
Ylivieska,15251,0.3,0.3,1.2,13.3,23.1
Ylöjärvi,32878,0.2,0.3,1.2,11.7,20.3
Ypäjä,2372,-0.4,0.7,1.9,13.2,31.4
Ähtäri,5906,-1.3,0.1,0.9,13.0,35.1
Äänekoski,19144,-1.2,0.1,1.2,19.7,30.5

In [53]:
## alternative solution
def municipalities_of_finland():
    df = pd.read_csv("municipal.tsv", sep="\t", index_col=0)
    return df["Akaa":"Äänekoski"]

In [54]:
## exercise 05: swedish and foreigners
def swedish_and_foreigners():
    municipalities = pd.read_csv("municipal.tsv", sep="\t", index_col = 'Region 2018')[1:312]
    swedish = municipalities[(municipalities['Share of Swedish-speakers of the population, %'] > 5) & (municipalities['Share of foreign citizens of the population, %'] > 5)]
    swedish = swedish[['Population', 'Share of Swedish-speakers of the population, %', 'Share of foreign citizens of the population, %']]
    return swedish

In [55]:
swedish_and_foreigners()#.value_counts('Share of Swedish-speakers of the population, %')

,Population,"Share of Swedish-speakers of the population, %","Share of foreign citizens of the population, %"
Region 2018,,,
Brändö,452,72.6,8.4
Eckerö,948,89.7,11.5
Espoo,279044,7.2,10.5
Finström,2580,89.8,10.5
Föglö,532,84.2,17.3
Geta,495,86.9,13.5
Hammarland,1547,89.7,11.6
Helsinki,643272,5.7,9.5
Jomala,4859,89.1,8.5
Kaskinen,1274,29.9,5.3
Kirkkonummi,39170,16.6,5.5
Korsnäs,2154,85.8,9.1
Kumlinge,314,85.4,8.0
Kökar,236,87.7,8.1
Lapinjärvi,2706,31.2,5.1
Lemland,2028,92.1,8.0
Lumparland,395,86.6,9.9
Mariehamn,11677,84.2,13.0
Närpiö,9507,80.4,12.7
Pietarsaari,19379,56.2,7.1
Saltvik,1873,91.9,6.3
Sottunga,92,93.5,5.4
Sund,1031,88.8,8.5
Turku,189669,5.4,6.5
Uusikaarlepyy,7521,86.7,6.1
Vaasa,67392,22.8,6.0
Vårdö,430,88.1,9.5
Vöyri,6616,81.1,5.7

In [56]:
## another solution:
def swedish_and_foreigners():
    df = pd.read_csv("municipal.tsv", index_col=0, sep="\t")
    df = df["Akaa":"Äänekoski"]
    m = ((df["Share of Swedish-speakers of the population, %"] > 5.0) &
         (df["Share of foreign citizens of the population, %"] > 5.0))
    df = df[m]
    df = df[["Population", "Share of Swedish-speakers of the population, %",
             "Share of foreign citizens of the population, %"]]
    return df

In [57]:
## exercise 06: growing municipalities
def growing_municipalities(df):
    municipalities = pd.read_csv("municipal.tsv", sep="\t", index_col = 'Region 2018')[1:312]
    growing = municipalities[municipalities['Population change from the previous year, %'] > 0]
    return growing[['Population change from the previous year, %']]

In [58]:
print(f"Proportion of growing municipalities: {0:3.1f}%".format(growing_municipalities(df)))

Proportion of growing municipalities: 0.0%

In [59]:
def growing_municipalities(df):
    m = df[df['Population change from the previous year, %']>0]
    return m.shape[0]/df.shape[0]
    
filename = "municipal.tsv"
df = pd.read_csv(filename,sep='\t')
statement = "Proportion of growing municipalities:" 
proportion = "{:.1f}%".format(growing_municipalities(df)*100)
print(statement,proportion)

Proportion of growing municipalities: 21.6%

In [60]:
## alternative solution

def growing_municipalities(df):
    c="Population change from the previous year, %"
    n = len(df)
    k = sum(df[c] > 0.0)
    return k / n

def main():
    df = pd.read_csv("src/municipal.tsv", index_col=0, sep="\t")
    df = df["Akaa":"Äänekoski"]
    proportion = growing_municipalities(df)
    print(f"Proportion of growing municipalities: {proportion:.1%}")

## Alternative indexing data selection

In [67]:
df.loc[1, "Wage"]

1500

In [68]:
df.iloc[-1,-1] #right lower corner of the DataFrame

29

In [69]:
df.loc[1, ["Name", "Wage"]]

Name    John
Wage    1500
Name: 1, dtype: object

In [70]:
## exercise 07: subsetting with loc
def subsetting_with_loc():
    df = pd.read_csv("municipal.tsv", index_col=0, sep="\t")
    df = df["Akaa":"Äänekoski"]
    df = df.loc[:, ['Population', 'Share of Swedish-speakers of the population, %', 'Share of foreign citizens of the population, %']]
    return df

In [71]:
subsetting_with_loc()

,Population,"Share of Swedish-speakers of the population, %","Share of foreign citizens of the population, %"
Region 2018,,,
Akaa,16769,0.2,1.6
Alajärvi,9831,0.1,1.9
Alavieska,2610,0.2,0.6
Alavus,11713,0.1,1.1
Asikkala,8248,0.2,1.6
...,...,...,...
Ylivieska,15251,0.3,1.2
Ylöjärvi,32878,0.3,1.2
Ypäjä,2372,0.7,1.9
Ähtäri,5906,0.1,0.9
Äänekoski,19144,0.1,1.2

In [72]:
## alternative solution
def subsetting_with_loc():
    df = pd.read_csv("municipal.tsv", index_col=0, sep="\t")
    df = df.loc["Akaa":"Äänekoski", ["Population", "Share of Swedish-speakers of the population, %", "Share of foreign citizens of the population, %"]]
    return df

In [73]:
## exercise 08: subsetting by positions
def subsetting_by_positions():
    df = pd.read_csv("UK-top40-1964-1-2.tsv", index_col=0, sep="\t")
    df = df.iloc[:10, [1,2]]
    return df

In [74]:
subsetting_by_positions()

                            Title                    Artist
Pos
1        I WANT TO HOLD YOUR HAND               THE BEATLES
2                   GLAD ALL OVER       THE DAVE CLARK FIVE
3                   SHE LOVES YOU               THE BEATLES
4            YOU WERE MADE FOR ME  FREDDIE AND THE DREAMERS
5    TWENTY FOUR HOURS FROM TULSA               GENE PITNEY
6      I ONLY WANT TO BE WITH YOU         DUSTY SPRINGFIELD
7                       DOMINIQUE           THE SINGING NUN
8                     MARIA ELENA      LOS INDIOS TABAJARAS
9                     SECRET LOVE               KATHY KIRBY
10              DON'T TALK TO HIM             CLIFF RICHARD

In [75]:
## alternative solution
def subsetting_by_positions():
    df = pd.read_csv("UK-top40-1964-1-2.tsv", sep="\t")
    return df.iloc[:10,2:4]

## Summary statistics

In [76]:
wh = pd.read_csv("https://raw.githubusercontent.com/csmastersUH/data_analysis_with_python_2020/master/kumpula-weather-2017.csv")

In [77]:
wh2 = wh.drop(["Year", "m", "d"], axis=1)  # taking averages over these is not very interesting
wh2.mean()

<ipython-input-77-fed339198b77>:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  wh2.mean()

Precipitation amount (mm)    1.966301
Snow depth (cm)              0.966480
Air temperature (degC)       6.527123
dtype: float64

In [78]:
##the describe method gives summary stadistics for each numeric columns in a dataframe format.
wh.describe()

,Year,m,d,Precipitation amount (mm),Snow depth (cm),Air temperature (degC)
count,365.0,365.000000,365.000000,365.000000,358.000000,365.000000
mean,2017.0,6.526027,15.720548,1.966301,0.966480,6.527123
std,0.0,3.452584,8.808321,4.858423,3.717472,7.183934
min,2017.0,1.000000,1.000000,-1.000000,-1.000000,-17.800000
25%,2017.0,4.000000,8.000000,-1.000000,-1.000000,1.200000
50%,2017.0,7.000000,16.000000,0.200000,-1.000000,4.800000
75%,2017.0,10.000000,23.000000,2.700000,0.000000,12.900000
max,2017.0,12.000000,31.000000,35.000000,15.000000,19.600000

In [79]:
## exercise 09: snow depth

In [80]:
def snow_depth(): 
    df = pd.read_csv('kumpula-weather-2017.csv', sep = ',')    
    snow = df.loc[:, ['Snow depth (cm)']]
    max_snow = snow.describe()
    return max_snow.iloc[-1,-1]

In [81]:
proportion = snow_depth()
print(f"Max snow depth: {proportion:.1f}")

Max snow depth: 15.0

In [82]:
## alternative solution
def snow_depth():
    df = pd.read_csv("src/kumpula-weather-2017.csv")
    return df["Snow depth (cm)"].max()

In [83]:
## exercise 10: average temperature in july
def average_temperature():
    df = pd.read_csv("kumpula-weather-2017.csv")
    july_temp = df.loc[df['m'] == 7,:]
    avg_july_temp = july_temp['Air temperature (degC)'].mean()
    return avg_july_temp

In [84]:
proportion = average_temperature()
print(f"Average temperature in July: {proportion:.1f}")

Average temperature in July: 16.0

In [85]:
## alternative solution
def average_temperature():
    df = pd.read_csv("src/kumpula-weather-2017.csv", sep=",")
    m = df["m"] == 7
    return df[m]["Air temperature (degC)"].mean()

In [86]:
## exercise 11: below zero
def below_zero():
    df = pd.read_csv("kumpula-weather-2017.csv", sep=",")
    below_zero_df = df.loc[df['Air temperature (degC)'] < 0]
    below_zero_days = below_zero_df.shape[0]
    return below_zero_days

In [87]:
print(f"Number of days below zero: {below_zero():.0f}")

Number of days below zero: 49

In [88]:
## alternative solution
def below_zero():
    df = pd.read_csv("kumpula-weather-2017.csv")
    return sum(df["Air temperature (degC)"] < 0.0)

## Missing data

In [91]:
#if we check the unique values of the column, we see some nan values
wh["Snow depth (cm)"].unique()

array([-1.,  7., 13., 10., 12.,  9.,  8.,  5.,  6.,  4.,  3., 15., 14.,
        2., nan,  0.])

In [92]:
# the floeat type accepts nan in additionto normal floating point numbers. THis value represents the results from illegal operations -- as 0/0

In [93]:
pd.Series([1,3,2])

0    1
1    3
2    2
dtype: int64

In [94]:
pd.Series([1,3,2, np.nan])

0    1.0
1    3.0
2    2.0
3    NaN
dtype: float64

In [95]:
## for non-numeric types the special value None is used to denote a missing value, the dtype is promoted to object

In [96]:
pd.Series(["jack", "joe", None])

0    jack
1     joe
2    None
dtype: object

In [97]:
##pandas excludes the missing values from summary statistics -- but we have functions to handle null values
wh.isnull()      # returns a boolean mask DataFrame

,Year,m,d,Time,Time zone,Precipitation amount (mm),Snow depth (cm),Air temperature (degC)
0,False,False,False,False,False,False,False,False
1,False,False,False,False,False,False,False,False
2,False,False,False,False,False,False,False,False
3,False,False,False,False,False,False,False,False
4,False,False,False,False,False,False,False,False
...,...,...,...,...,...,...,...,...
360,False,False,False,False,False,False,False,False
361,False,False,False,False,False,False,False,False
362,False,False,False,False,False,False,False,False
363,False,False,False,False,False,False,False,False
364,False,False,False,False,False,False,False,False

In [98]:
# combining it with the any method, you can mask the null rows
# notnull is inverse from isnull
wh[wh.isnull().any(axis=1)]

,Year,m,d,Time,Time zone,Precipitation amount (mm),Snow depth (cm),Air temperature (degC)
74,2017,3,16,00:00,UTC,1.8,NaN,3.4
163,2017,6,13,00:00,UTC,0.6,NaN,12.6
308,2017,11,5,00:00,UTC,0.2,NaN,8.4
309,2017,11,6,00:00,UTC,2.0,NaN,7.5
313,2017,11,10,00:00,UTC,3.6,NaN,7.2
321,2017,11,18,00:00,UTC,11.3,NaN,5.9
328,2017,11,25,00:00,UTC,8.5,NaN,4.2

In [100]:
#  dropna drops columns that contain missing values from the dataframe
# the drop and tthresh parameters allow to specify how many values need to be missing, in order to drop the element
wh.dropna().shape   # Default axis is 0

(358, 8)

In [101]:
#depending on the axis, you drop the ros (0) or columns (1)
wh.dropna(axis=1).shape # Drops the columns containing missing values

(365, 7)

In [102]:
# fillna fills the missing values with constant or interpolated values
# ffill: use the previous value to fill the current value
# bfill: use the next value to fill the current value
wh = wh.fillna(method='ffill')
wh[wh.isnull().any(axis=1)]

Empty DataFrame
Columns: [Year, m, d, Time, Time zone, Precipitation amount (mm), Snow depth (cm), Air temperature (degC)]
Index: []

In [103]:
# exercise 12: cyclist

def cyclists():
    df = pd.read_csv('Helsingin_pyorailijamaarat.csv', sep = ';')
    df_rows = df.dropna(how='all', axis = 0)
    df_columns = df_rows.dropna(how = 'all', axis = 1)
    return df_columns

In [110]:
## alternative solution
def cyclists():
    df = pd.read_csv("Helsingin_pyorailijamaarat.csv", sep=";")
    df = df.dropna(axis=0, how="all")
    df = df.dropna(axis=1, how="all")
    return df

In [111]:
df = cyclists()
print("Shape: {}, {}".format(*df.shape))
for name in df.columns:
    print(name)

Shape: 37128, 21
Päivämäärä
Auroransilta
Eteläesplanadi
Huopalahti (asema)
Kaisaniemi/Eläintarhanlahti
Kaivokatu
Kulosaaren silta et.
Kulosaaren silta po.
Kuusisaarentie
Käpylä, Pohjoisbaana
Lauttasaaren silta eteläpuoli
Merikannontie
Munkkiniemen silta eteläpuoli
Munkkiniemi silta pohjoispuoli
Heperian puisto/Ooppera
Pitkäsilta itäpuoli
Pitkäsilta länsipuoli
Lauttasaaren silta pohjoispuoli
Ratapihantie
Viikintie
Baana

In [112]:
## exercise 13: missing value types
def missing_value_types():
    df = pd.DataFrame([['-', '-'], [1917, 'Niinistö'], [1776, "Trump"],[1523, '-'], ['-', 'Steinmeier'], 
    [1992, "Putin"]], columns = ['Year of independence', 'President'], 
    index = ["United Kingdom" , "Finland" , "USA", "Sweden", "Germany", "Russia"] ) 
    df = df.replace('-', np.nan)
    return df

In [113]:
missing_value_types().dtypes

Year of independence    float64
President                object
dtype: object

In [114]:
# alternative solution
def missing_value_types():
    df=pd.DataFrame([["United Kingdom", np.nan, None],
                     ["Finland",        1917,   "Niinistö"],
                     ["USA",            1776,   "Trump"],
                     ["Sweden",         1523,   None],
                     ["Germany",        np.nan, "Steinmeier"],
                     ["Russia",         1992,   "Putin"]],
                    columns=["State", "Year of independence", "President"])
    df = df.set_index("State")
    return df

In [115]:
    df = missing_value_types()
    print("Column names:", df.columns)
    print("dtypes:", df.dtypes)
    print(df)

Column names: Index(['Year of independence', 'President'], dtype='object')
dtypes: Year of independence    float64
President                object
dtype: object
                Year of independence   President
State
United Kingdom                   NaN        None
Finland                       1917.0    Niinistö
USA                           1776.0       Trump
Sweden                        1523.0        None
Germany                          NaN  Steinmeier
Russia                        1992.0       Putin

In [167]:
## exercise 14: special missing value
def special_missing_values():
    df = pd.read_csv("UK-top40-1964-1-2.tsv", sep = "\t")
    df = df.replace({"New": np.nan, "Re": np.nan})
    special_df = df.loc[(df['Pos'] > df['LW'].astype(float)), :]
    return special_df

In [168]:
DF = special_missing_values()
print("Shape: {}, {}".format(*DF.shape))
print("dtypes:", DF.dtypes, sep="\n")
print(DF)

Shape: 17, 7
dtypes:
Pos           int64
LW           object
Title        object
Artist       object
Publisher    object
Peak Pos      int64
WoC           int64
dtype: object
    Pos  LW                                 Title  \
2     3   2                         SHE LOVES YOU
3     4   3                  YOU WERE MADE FOR ME
5     6   5            I ONLY WANT TO BE WITH YOU
8     9   4                           SECRET LOVE
9    10   8                     DON'T TALK TO HIM
11   12  11                              GERONIMO
14   15  14                   I WANNA BE YOUR MAN
15   16  12               YOU'LL NEVER WALK ALONE
20   21  13               I'LL KEEP YOU SATISFIED
21   22  21                  IF I RULED THE WORLD
23   24  20  ALL I WANT FOR CHRISTMAS IS A BEATLE
29   30  22                  IT'S ALMOST TOMORROW
30   31  24                       HUNGRY FOR LOVE
33   34  33                           DEEP PURPLE
34   35  31                   BLOWING IN THE WIND
37   38  30                       SUGAR AND SPICE
38   39  37                      YESTERDAY'S GONE

                            Artist        Publisher  Peak Pos  WoC
2                      THE BEATLES       PARLOPHONE         1   19
3         FREDDIE AND THE DREAMERS         COLUMBIA         3    9
5                DUSTY SPRINGFIELD          PHILIPS         5    6
8                      KATHY KIRBY            DECCA         4    9
9                    CLIFF RICHARD         COLUMBIA         2    9
11                     THE SHADOWS         COLUMBIA        11    5
14              THE ROLLING STONES            DECCA        13    7
15        GERRY AND THE PACEMAKERS         COLUMBIA         1   13
20  BILLY J KRAMER AND THE DAKOTAS       PARLOPHONE         4    9
21                   HARRY SECOMBE          PHILIPS        18    7
23                      DORA BRYAN          FONTANA        20    5
29                     MARK WYNTER              PYE        12    8
30     JOHNNY KIDD AND THE PIRATES              HMV        20    6
33    NINO TEMPO AND APRIL STEVENS           LONDON        17    8
34            PETER, PAUL AND MARY  WARNER BROTHERS        13   11
37                   THE SEARCHERS              PYE         2   11
38    CHAD STUART AND JEREMY CLYDE            EMBER        37    4

In [169]:
def special_missing_values():
    df = pd.read_csv("src/UK-top40-1964-1-2.tsv", sep="\t")
    m = (df["LW"] == "New") | (df["LW"] == "Re")
    df.loc[m, "LW"] = np.nan
    df["LW"] = pd.to_numeric(df["LW"])
    m2 = df["LW"] < df["Pos"]
    return df[m2]

In [190]:
## exercise 15
def last_week():
    # Create DataFrame
    path = 'UK-top40-1964-1-2.tsv'
    df = pd.read_csv(path, sep='\t')
    # Modify values in last week column and clear entries that weren't on last week's list
    df.LW[df.LW == 'New'] = '1000'
    df.LW[df.LW == 'Re'] = '1000'
    df.LW = df.LW.astype('int')
    indices = df.index[df.LW == 1000].tolist()
    df.iloc[indices] = np.nan
    # Peak pos 
    df['Peak Pos'].mask((df.LW > df['Peak Pos']) & (df.Pos == df['Peak Pos']), inplace=True)
    # Create New DataFrame of last week
    last_week = df.copy()
    last_week.Pos = df.LW
    # Clear the whole LW column in last_week, 
    # because we can't know positions of songs from two weeks ago
    last_week.LW = None
    # Find missing positions
    all_positions = set(range(1,41))
    existing_positions = set(last_week.Pos[pd.notna(last_week.Pos)].tolist())
    missing_positions = list(all_positions - existing_positions)
    # Insert missing positions into last_week
    last_week.Pos[pd.isna(last_week.Pos)] = missing_positions
    # Sort last_week based on the position column and reset indices
    last_week.sort_values('Pos', axis='index', inplace=True)
    last_week.reset_index(inplace=True, drop=True)
    # Subtract one from WOC, weeks on chart
    last_week.WoC = last_week.WoC -1
    return last_week

In [217]:
last_week()

,Pos,LW,Title,Artist,Publisher,Peak Pos,WoC
0,1.0,NaN,I WANT TO HOLD YOUR HAND,THE BEATLES,PARLOPHONE,1.0,4.0
2,2.0,NaN,SHE LOVES YOU,THE BEATLES,PARLOPHONE,1.0,18.0
3,3.0,NaN,YOU WERE MADE FOR ME,FREDDIE AND THE DREAMERS,COLUMBIA,3.0,8.0
8,4.0,NaN,SECRET LOVE,KATHY KIRBY,DECCA,4.0,8.0
5,5.0,NaN,I ONLY WANT TO BE WITH YOU,DUSTY SPRINGFIELD,PHILIPS,5.0,5.0
1,6.0,NaN,GLAD ALL OVER,THE DAVE CLARK FIVE,COLUMBIA,2.0,6.0
6,7.0,NaN,DOMINIQUE,THE SINGING NUN,PHILIPS,7.0,4.0
9,8.0,NaN,DON'T TALK TO HIM,CLIFF RICHARD,COLUMBIA,2.0,8.0
4,9.0,NaN,TWENTY FOUR HOURS FROM TULSA,GENE PITNEY,UNITED ARTISTS,5.0,4.0
7,10.0,NaN,MARIA ELENA,LOS INDIOS TABAJARAS,RCA,5.0,8.0
11,11.0,NaN,GERONIMO,THE SHADOWS,COLUMBIA,11.0,4.0
15,12.0,NaN,YOU'LL NEVER WALK ALONE,GERRY AND THE PACEMAKERS,COLUMBIA,1.0,12.0
20,13.0,NaN,I'LL KEEP YOU SATISFIED,BILLY J KRAMER AND THE DAKOTAS,PARLOPHONE,4.0,8.0
14,14.0,NaN,I WANNA BE YOUR MAN,THE ROLLING STONES,DECCA,13.0,6.0
10,15.0,NaN,SWINGING ON A STAR,BIG DEE IRWIN,COLPIX,11.0,4.0
13,16.0,NaN,KISS ME QUICK,ELVIS PRESLEY,RCA,14.0,2.0
16,17.0,NaN,STAY,THE HOLLIES,PARLOPHONE,17.0,5.0
17,18.0,NaN,NOT TOO LITTLE - NOT TOO MUCH,CHRIS SANDFORD,DECCA,17.0,3.0
18,19.0,NaN,MONEY,BERN ELLIOTT AND THE FENMEN,DECCA,14.0,5.0
23,20.0,NaN,ALL I WANT FOR CHRISTMAS IS A BEATLE,DORA BRYAN,FONTANA,20.0,4.0
21,21.0,NaN,IF I RULED THE WORLD,HARRY SECOMBE,PHILIPS,18.0,6.0
29,22.0,NaN,IT'S ALMOST TOMORROW,MARK WYNTER,PYE,12.0,7.0
12,23.0,NaN,HIPPY HIPPY SHAKE,SWINGING BLUE JEANS,HMV,13.0,2.0
30,24.0,NaN,HUNGRY FOR LOVE,JOHNNY KIDD AND THE PIRATES,HMV,20.0,5.0
24,25.0,NaN,I (WHO HAVE NOTHING),SHIRLEY BASSEY,COLUMBIA,6.0,13.0
22,26.0,NaN,BLUE BAYOU/MEAN WOMAN BLUES,ROY ORBISON,LONDON,3.0,14.0
19,27.0,NaN,WE ARE IN LOVE,ADAM FAITH,PARLOPHONE,20.0,2.0
26,28.0,NaN,COUNTRY BOY,HEINZ,DECCA,26.0,4.0
27,29.0,NaN,WHAT TO DO {1963},BUDDY HOLLY,CORAL,28.0,2.0
37,30.0,NaN,SUGAR AND SPICE,THE SEARCHERS,PYE,2.0,10.0
34,31.0,NaN,BLOWING IN THE WIND,"PETER, PAUL AND MARY",WARNER BROTHERS,13.0,10.0
25,32.0,NaN,AT THE PALACE (PARTS 1 AND 2),WILFRED BRAMBELL AND HARRY H CORBETT,PYE,26.0,4.0
33,33.0,NaN,DEEP PURPLE,NINO TEMPO AND APRIL STEVENS,LONDON,17.0,7.0
32,34.0,NaN,I CAN DANCE,BRIAN POOLE AND THE TREMELOES,DECCA,31.0,4.0
35,35.0,NaN,NaN,NaN,NaN,NaN,NaN
28,36.0,NaN,FROM RUSSIA WITH LOVE,MATT MONRO,PARLOPHONE,20.0,6.0
38,37.0,NaN,YESTERDAY'S GONE,CHAD STUART AND JEREMY CLYDE,EMBER,37.0,3.0
39,39.0,NaN,NaN,NaN,NaN,NaN,NaN
31,NaN,NaN,NaN,NaN,NaN,NaN,NaN
36,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [216]:
## alternative solution
def last_week():
    df = pd.read_csv("src/UK-top40-1964-1-2.tsv", sep="\t")
    orig_columns = df.columns
    re_or_new = (df["LW"] == "Re") | (df["LW"] == "New")
    df=df[~re_or_new]
    df.LW = df.LW.astype(int)
    second_time = df["WoC"] == 2
    on_the_peak_last_week = second_time & ((df.Pos < df["Peak Pos"]) | (df["Peak Pos"] == 40))
    last_week = df.copy()
    last_week.Pos = df.LW
    last_week.LW = df.where(on_the_peak_last_week)["Peak Pos"]
    last_week.WoC = df.WoC - 1
    last_week["Peak Pos"] = df["Peak Pos"].where((df.Pos != df["Peak Pos"]) |

                                                 ((df.Pos == df["Peak Pos"]) &

                                                  (df.LW == df["Peak Pos"])),

                                                 df.LW.where(df.WoC == 2))
    #print(df)
    #print(df.dtypes)
    s = set(range(1, 41)).difference(set(last_week.Pos))
    unknown = pd.DataFrame(list(s), columns=["Pos"])
    #print(unknown)
    version = list(map(int, pd.__version__.split(".")))
    if version[0] == 0 and version[1] < 23:   # older Pandas versions don't support sort option
        last_week = pd.concat([last_week, unknown], ignore_index=True)
    else:
        last_week = pd.concat([last_week, unknown], ignore_index=True, sort=False)
    last_week = last_week[orig_columns]
    return last_week.sort_values(by="Pos", axis=0)

,Pos,LW,Title,Artist,Publisher,Peak Pos,WoC,Pelicano,Pos_
0,1,1.0,I WANT TO HOLD YOUR HAND,THE BEATLES,PARLOPHONE,1,4,0,1.0
2,3,2.0,SHE LOVES YOU,THE BEATLES,PARLOPHONE,1,18,0,2.0
3,4,3.0,YOU WERE MADE FOR ME,FREDDIE AND THE DREAMERS,COLUMBIA,3,8,0,3.0
8,9,4.0,SECRET LOVE,KATHY KIRBY,DECCA,4,8,0,4.0
5,6,5.0,I ONLY WANT TO BE WITH YOU,DUSTY SPRINGFIELD,PHILIPS,5,5,0,5.0
1,2,6.0,GLAD ALL OVER,THE DAVE CLARK FIVE,COLUMBIA,2,6,0,6.0
6,7,7.0,DOMINIQUE,THE SINGING NUN,PHILIPS,7,4,0,7.0
9,10,8.0,DON'T TALK TO HIM,CLIFF RICHARD,COLUMBIA,2,8,0,8.0
4,5,9.0,TWENTY FOUR HOURS FROM TULSA,GENE PITNEY,UNITED ARTISTS,5,4,0,9.0
7,8,10.0,MARIA ELENA,LOS INDIOS TABAJARAS,RCA,5,8,0,10.0
11,12,11.0,GERONIMO,THE SHADOWS,COLUMBIA,11,4,0,11.0
15,16,12.0,YOU'LL NEVER WALK ALONE,GERRY AND THE PACEMAKERS,COLUMBIA,1,12,0,12.0
20,21,13.0,I'LL KEEP YOU SATISFIED,BILLY J KRAMER AND THE DAKOTAS,PARLOPHONE,4,8,0,13.0
14,15,14.0,I WANNA BE YOUR MAN,THE ROLLING STONES,DECCA,13,6,0,14.0
10,11,15.0,SWINGING ON A STAR,BIG DEE IRWIN,COLPIX,11,4,0,15.0
13,14,16.0,KISS ME QUICK,ELVIS PRESLEY,RCA,14,2,0,16.0
16,17,17.0,STAY,THE HOLLIES,PARLOPHONE,17,5,0,17.0
17,18,18.0,NOT TOO LITTLE - NOT TOO MUCH,CHRIS SANDFORD,DECCA,17,3,0,18.0
18,19,19.0,MONEY,BERN ELLIOTT AND THE FENMEN,DECCA,14,5,0,19.0
23,24,20.0,ALL I WANT FOR CHRISTMAS IS A BEATLE,DORA BRYAN,FONTANA,20,4,0,20.0
21,22,21.0,IF I RULED THE WORLD,HARRY SECOMBE,PHILIPS,18,6,0,21.0
29,30,22.0,IT'S ALMOST TOMORROW,MARK WYNTER,PYE,12,7,0,22.0
12,13,23.0,HIPPY HIPPY SHAKE,SWINGING BLUE JEANS,HMV,13,2,0,23.0
30,31,24.0,HUNGRY FOR LOVE,JOHNNY KIDD AND THE PIRATES,HMV,20,5,0,24.0
24,25,25.0,I (WHO HAVE NOTHING),SHIRLEY BASSEY,COLUMBIA,6,13,0,25.0
22,23,26.0,BLUE BAYOU/MEAN WOMAN BLUES,ROY ORBISON,LONDON,3,14,0,26.0
19,20,27.0,WE ARE IN LOVE,ADAM FAITH,PARLOPHONE,20,2,0,27.0
26,27,28.0,COUNTRY BOY,HEINZ,DECCA,26,4,0,28.0
27,28,29.0,WHAT TO DO {1963},BUDDY HOLLY,CORAL,28,2,0,29.0
37,38,30.0,SUGAR AND SPICE,THE SEARCHERS,PYE,2,10,0,30.0
34,35,31.0,BLOWING IN THE WIND,"PETER, PAUL AND MARY",WARNER BROTHERS,13,10,0,31.0
25,26,32.0,AT THE PALACE (PARTS 1 AND 2),WILFRED BRAMBELL AND HARRY H CORBETT,PYE,26,4,0,32.0
33,34,33.0,DEEP PURPLE,NINO TEMPO AND APRIL STEVENS,LONDON,17,7,0,33.0
32,33,34.0,I CAN DANCE,BRIAN POOLE AND THE TREMELOES,DECCA,31,4,0,34.0
28,29,36.0,FROM RUSSIA WITH LOVE,MATT MONRO,PARLOPHONE,20,6,0,36.0
38,39,37.0,YESTERDAY'S GONE,CHAD STUART AND JEREMY CLYDE,EMBER,37,3,0,37.0
31,32,NaN,I'M IN LOVE,FOURMOST,PARLOPHONE,32,0,0,NaN
35,36,NaN,RUN RUDOLF RUN,CHUCK BERRY,PYE INTERNATIONAL,36,1,0,NaN
36,37,NaN,DO YOU REALLY LOVE ME TOO?,BILLY FURY,DECCA,37,0,0,NaN
39,40,NaN,WALKING ALONE,RICHARD ANTHONY,COLUMBIA,37,1,0,NaN

## converting columns from one type to the other

In [218]:
pd.Series(["1","2"]).map(int)                           # str -> int

0    1
1    2
dtype: int64

In [219]:
pd.Series([1,2]).map(str)                               # int -> str

0    1
1    2
dtype: object

In [220]:
pd.to_numeric(pd.Series([1,1.0]), downcast="integer")   # object -> int

0    1
1    1
dtype: int8

In [221]:
pd.to_numeric(pd.Series([1,"a"]), errors="coerce")      # conversion error pro

0    1.0
1    NaN
dtype: float64

In [222]:
pd.Series([1,2]).astype(str)                            # works for a single series

0    1
1    2
dtype: object

In [223]:
df = pd.DataFrame({"a": [1,2,3], "b" : [4,5,6], "c" : [7,8,9]})
print(df.dtypes)
print(df)

a    int64
b    int64
c    int64
dtype: object
   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [224]:
df.astype(float)                       # Convert all columns

     a    b    c
0  1.0  4.0  7.0
1  2.0  5.0  8.0
2  3.0  6.0  9.0

In [225]:
df2 = df.astype({"b" : float, "c" : str})    # different types for columns
print(df2.dtypes)
print(df2)

a      int64
b    float64
c     object
dtype: object
   a    b  c
0  1  4.0  7
1  2  5.0  8
2  3  6.0  9

## String processing

In [226]:
names = pd.Series(["donald", "theresa", "angela", "vladimir"])
names.str.capitalize()

0      Donald
1     Theresa
2      Angela
3    Vladimir
dtype: object

In [ ]:
## to check all the values aligned with .str method
#names.str.

In [227]:
full_names = pd.Series(["Donald Trump", "Theresa May", "Angela Merkel", "Vladimir Putin"])
full_names.str.split()

0      [Donald, Trump]
1       [Theresa, May]
2     [Angela, Merkel]
3    [Vladimir, Putin]
dtype: object

In [228]:
full_names.str.split(expand=True)

          0       1
0    Donald   Trump
1   Theresa     May
2    Angela  Merkel
3  Vladimir   Putin

In [280]:
## exercise 16: split date
def split_date():
    kk = pd.read_csv('Helsingin_pyorailijamaarat.csv', sep = ';', header = 0)
    kk = kk.dropna(axis=0, how='all')
    kk = kk.dropna(axis=1, how='all')
    kk[["Weekday", "Day", "Month", "Year", "Hour"]] = kk['Päivämäärä'].str.split(expand=True)

    kk[["Weekday"]] = kk[["Weekday"]].replace({"ma": "Mon", "ti": "Tue", "ke": "Wed", "to": "Thu", 
        "pe": "Fri", "la": "Sat", "su": "Sun"})
    kk[["Month"]] = kk[["Month"]].replace({"tammi": "1", "helmi": "2", "maalis": "3", "huhti": "4", 
        "touko": "5", "kesä": "6", "heinä": "7", "elo": "8", "syys": "9", "loka": "10", "marras": "11",
        "joulu": "12"})
    kk["Hour"] = kk["Hour"].str.split(":", expand=True)[0].map(int)
    kk['Päivämäärä'] = kk["Weekday"] + " " + kk["Day"] + " " + kk["Month"] + " " + kk["Year"] + " " + kk["Hour"].map(str)
    kk = kk[kk.columns.tolist()[-5:] + [kk.columns.tolist()[0]]]
    kk
    return kk

In [288]:
split_date()

      Weekday  Day  Month  Year  Hour
0         Wed    1      1  2014     0
1         Wed    1      1  2014     1
2         Wed    1      1  2014     2
3         Wed    1      1  2014     3
4         Wed    1      1  2014     4
...       ...  ...    ...   ...   ...
37123     Tue   27      3  2018    19
37124     Tue   27      3  2018    20
37125     Tue   27      3  2018    21
37126     Tue   27      3  2018    22
37127     Tue   27      3  2018    23

[37128 rows x 5 columns]

In [287]:
## alternative solution
days = dict(zip("ma ti ke to pe la su".split(), "Mon Tue Wed Thu Fri Sat Sun".split()))

months = dict(zip("tammi helmi maalis huhti touko kesä heinä elo syys loka marras joulu".split(), range(1,13)))

def split_date():
    df = pd.read_csv("Helsingin_pyorailijamaarat.csv", sep=";")
    df = df.dropna(axis=0, how="all").dropna(axis=1, how="all")
    d = df["Päivämäärä"].str.split(expand=True)
    d.columns = ["Weekday", "Day", "Month", "Year", "Hour"]
    hourmin = d["Hour"].str.split(":", expand=True)
    d["Hour"] = hourmin.iloc[:,0]
    d["Weekday"] = d["Weekday"].map(days)
    d["Month"] = d["Month"].map(months) 
    d = d.astype({"Weekday": object, "Day": int, "Month": int, "Year": int, "Hour": int})
    return d

In [ ]:
##exercise 17: cleaning data
def cleaning_data():
    return clean